window.languages={
/*хотите перевести? скопируйте весь default, киньте в нейронку, попросите перевести не нарушая структуру файла, переименуйте его в название другого языка, после чего вставьте полученный язык после default. вы сможете применить полученный язык в настройках игры. чтобы попасть в них, нажмите кнопку "иллюзия контроля" в главном меню*/
default:{
	contribution:{
		'⦑color:#f0f⦒essensuOFnull':`инициатор, автор идей, программист.`,
		'⦑color:#909⦒仨与与仨刀仁仨・口千・力仨与户升工艮':`возможно нарисует текстуры в будущем.`,
		'⦑color:#00f⦒Theb.ai, DeepSeek':`помощь в программировании.`
	},
	settings:{
		interface:{
			name:`настройки интерфейса`,
			options:{
				language:`приоритет дополнительных языков`,
				font_size:`размер знакомест (не рекомендуется менять)`,
				max_content_width:`максимальная ширина содержимого окна`,
				max_content_height:`максимальная высота содержимого окна`
			}
		},
		audio:{
			name:`настройки аудио`,
			options:{
				music_volume:`громкость музыки`,
				sounds_volume:`громкость звуков`
			}
		},
		control:{
			name:`настройки управления`,
			options:{
				left:`влево`,
				right:`вправо`,
				jump:`прыжок`
			}
		}
	},
	rooms:{
		main_menu:{
			buttons:{
				new_game:`рискнуть начать новую игру`,
				continue:`бесцельно продолжить`,
				settings:`иллюзия контроля`,
				authors:`пантеон творцов`,
				exit:`вылет`
			}
		},
		authors:{
			buttons:{
				back:`назад`
			}
		},
		settings:{
			drop_zone:`зона\nзагрузки\nфайлов`,
			buttons:{
				back:`назад`,
				add:`+`
			}
		}
	}
},
адекватность:{
	rooms:{
		main_menu:{
			buttons:{
				new_game:`новая игра`,
				continue:`продолжить`,
				settings:`настройки`,
				authors:`авторы`,
				exit:`выход`
			}
		}
	}
}
}